In [98]:
import pandas as pd
import numpy as np

In [99]:
# dataframe
data = {'country': ['Belgium', 'France', 'Germany', 'Netherlands', 'United Kingdom'],
        'population': [11.3, 64.3, 81.3, 16.9, 64.9],
        'area': [30510, 671308, 357050, 41526, 244820],
        'capital': ['Brussels', 'Paris', 'Berlin', 'Amsterdam', 'London']}
countries = pd.DataFrame(data)
countries = countries.set_index('country') # 인덱스 지정
countries

                population    area    capital
country
Belgium               11.3   30510   Brussels
France                64.3  671308      Paris
Germany               81.3  357050     Berlin
Netherlands           16.9   41526  Amsterdam
United Kingdom        64.9  244820     London

In [100]:
countries.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Belgium to United Kingdom
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   population  5 non-null      float64
 1   area        5 non-null      int64
 2   capital     5 non-null      object
dtypes: float64(1), int64(1), object(1)
memory usage: 160.0+ bytes

---

<div class="alert alert-success">
    <b>EXERCISE 01</b>: 인구밀도를 의미하는 `density` 칼럼을 추가하세요. (주의: 현재 'population' 칼럼은 100만 단위로 표기되어 있습니다)  
  
</div>

In [101]:
countries['density']=countries['population']*1000000/countries['area']
countries

                population    area    capital     density
country
Belgium               11.3   30510   Brussels  370.370370
France                64.3  671308      Paris   95.783158
Germany               81.3  357050     Berlin  227.699202
Netherlands           16.9   41526  Amsterdam  406.973944
United Kingdom        64.9  244820     London  265.092721

<div class="alert alert-success">
    <b>EXERCISE 02</b>: 인구밀도가 300을 초과하는 국가(country)의 수도(capital)과 인구(population)을 선택해주세요.  
  
</div>

In [102]:
countries.loc[countries['density']>300,['capital','population']]

               capital  population
country
Belgium       Brussels        11.3
Netherlands  Amsterdam        16.9

<div class="alert alert-success">
    <b>EXERCISE 03</b>: 'density_ratio' 칼럼을 추가해주세요. (density_ratio = 인구밀도/평균 인구밀도)
</div>

In [103]:
countries['density_ratio']=countries['density']/countries['density'].mean()
countries

                population    area    capital     density  density_ratio
country
Belgium               11.3   30510   Brussels  370.370370       1.355755
France                64.3  671308      Paris   95.783158       0.350618
Germany               81.3  357050     Berlin  227.699202       0.833502
Netherlands           16.9   41526  Amsterdam  406.973944       1.489744
United Kingdom        64.9  244820     London  265.092721       0.970382

<div class="alert alert-success">
    <b>EXERCISE 04</b>: 영국(United Kingdom)의 수도(capital)를 'Cambridge'로 변경해주세요.
</div>

In [104]:
countries.loc['United Kingdom','capital']='Cambridge'
countries

                population    area    capital     density  density_ratio
country
Belgium               11.3   30510   Brussels  370.370370       1.355755
France                64.3  671308      Paris   95.783158       0.350618
Germany               81.3  357050     Berlin  227.699202       0.833502
Netherlands           16.9   41526  Amsterdam  406.973944       1.489744
United Kingdom        64.9  244820  Cambridge  265.092721       0.970382

<div class="alert alert-success">
    <b>EXERCISE 05</b>: 인구 밀도가 100 초과, 300 미만인 국가들을 표시해주세요.  
</div>

In [105]:
countries[(countries['density']>100) & (countries['density']<300) ]

                population    area    capital     density  density_ratio
country
Germany               81.3  357050     Berlin  227.699202       0.833502
United Kingdom        64.9  244820  Cambridge  265.092721       0.970382

<div class="alert alert-success">
    <b>EXERCISE 06</b>: 수도가 7글자 이상인 국가들을 표시해주세요. (힌트: string의 len( )를 사용하세요.)
</div>

In [106]:
countries[countries['capital'].str.len() >= 7]

                population    area    capital     density  density_ratio
country
Belgium               11.3   30510   Brussels  370.370370       1.355755
Netherlands           16.9   41526  Amsterdam  406.973944       1.489744
United Kingdom        64.9  244820  Cambridge  265.092721       0.970382

<div class="alert alert-success">
    <b>EXERCISE 07</b>: 수도에 'am' 이 포함되는 국가들을 표시해주세요. (힌트: string의 contains( )를 사용하세요.)
</div>

In [107]:
countries[countries['capital'].str.contains('am')]

                population    area    capital     density  density_ratio
country
Netherlands           16.9   41526  Amsterdam  406.973944       1.489744
United Kingdom        64.9  244820  Cambridge  265.092721       0.970382

# 영화리뷰 데이터에서 자료 찾기

movie_title_data.tsv 읽어오기

https://drive.google.com/file/d/1cvBtLVyfhfodJK-BXWqBLcopyus9HOIc/view?usp=sharing

In [108]:
titles=pd.read_csv("./data/movie_title_data.tsv",sep='\t')
titles

C:\Users\Admin\AppData\Local\Temp\ipykernel_18192\3502545996.py:1: DtypeWarning: Columns (4,5) have mixed types. Specify dtype option on import or set low_memory=False.
  titles=pd.read_csv("./data/movie_title_data.tsv",sep='\t')

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"
...,...,...,...,...,...,...,...,...,...
8407394,tt9916848,tvEpisode,Episode #3.17,Episode #3.17,0,2010,\N,\N,"Action,Drama,Family"
8407395,tt9916850,tvEpisode,Episode #3.19,Episode #3.19,0,2010,\N,\N,"Action,Drama,Family"
8407396,tt9916852,tvEpisode,Episode #3.20,Episode #3.20,0,2010,\N,\N,"Action,Drama,Family"
8407397,tt9916856,short,The Wind,The Wind,0,2015,\N,27,Short
8407398,tt9916880,tvEpisode,Horrid Henry Knows It All,Horrid Henry Knows It All,0,2014,\N,10,"Adventure,Animation,Comedy"

In [109]:
titles.info(show_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8407399 entries, 0 to 8407398
Data columns (total 9 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   tconst          8407399 non-null  object
 1   titleType       8407399 non-null  object
 2   primaryTitle    8407385 non-null  object
 3   originalTitle   8407385 non-null  object
 4   isAdult         8407399 non-null  object
 5   startYear       8407399 non-null  object
 6   endYear         8407399 non-null  object
 7   runtimeMinutes  8407399 non-null  object
 8   genres          8407389 non-null  object
dtypes: object(9)
memory usage: 577.3+ MB

In [110]:
titles['startYear'].unique()

array([1894, 1892, 1893, 1895, 1896, 1898, 1897, 1900, 1899, 1901, 1902,
       1903, 1905, 1904, 1912, 1907, 1906, 1908, 1910, 1909, 1914, 1911,
       1913, 1915, 1919, 1916, 1917, 1918, 1936, 1925, 1920, 1922, 1921,
       1923, 2019, 1924, 1928, 1926, 1927, 1929, 2000, 1993, 1935, 2014,
       1930, 1942, 1934, 1931, 1932, 1939, 1937, 1933, 1950, 1938, 1951,
       1945, 1946, 1996, 1940, 1944, 1949, 1947, 1941, 1952, 1970, 1957,
       1943, 1959, 1948, 2001, 1953, 2008, 1954, 1965, 1983, 1980, 1973,
       1961, 1995, 1955, 1962, 1958, 1956, 1977, 1960, 1964, 1967, 1968,
       1963, 1986, 1971, 1969, 1972, 1966, 2021, 2002, 1976, 1990, 2020,
       1979, 1974, 1978, 1981, 1988, 1975, 1989, '1971', '1972', '1970',
       '1974', '1973', '1976', '1969', '1968', '1985', '\\N', '1981',
       '2009', '1980', '1986', '1965', '1987', '1975', '1978', '1967',
       '1990', '1977', '2010', '2018', '1979', '2007', '1989', '1983',
       '1988', '1984', '1966', '1982', '1992', '1991', '1952', '1963',
       '2001', '1961', '1994', '1993', '1964', '1957', '1999', '1995',
       '2019', '2005', '1953', '2004', '1998', '1947', '2002', '1997',
       '1959', '1996', '2017', '2000', '1945', '1956', '2021', '2013',
       '2016', '2006', '2003', '1955', '1949', '2008', '1960', '1930',
       '1938', '1929', '1944', '1935', '1962', '1919', '1951', '1914',
       '1954', '1958', '1907', '1942', '1918', '1943', '1921', '1927',
       '1941', '1939', '1940', '1937', '1950', '1946', '1916', '1948',
       '1934', '1912', '1911', '1926', '1933', '1936', '1925', '1932',
       '1928', '1917', '1920', '1931', '1913', '1895', '1922', '1923',
       '1924', '1900', '1908', '1915', '1910', '1897', '1905', '1909',
       '1903', '1902', '1901', '1906', '1904', '1898', '1896', '1899',
       '2012', '2014', '2020', '2015', '2011', '1894', '1892', '1893',
       '1891', '1888', '1890', '2022', '1889', '2023', '2024', '2025',
       '2027', '2026', '2028', '1878', '1877', '1882', '1881', '1887',
       '1874', '20\x115', '1883', '1885'], dtype=object)

In [111]:
titles['startYear'] = pd.to_numeric(titles['startYear'], errors='coerce') 
titles

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894.0,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892.0,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892.0,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892.0,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893.0,\N,1,"Comedy,Short"
...,...,...,...,...,...,...,...,...,...
8407394,tt9916848,tvEpisode,Episode #3.17,Episode #3.17,0,2010.0,\N,\N,"Action,Drama,Family"
8407395,tt9916850,tvEpisode,Episode #3.19,Episode #3.19,0,2010.0,\N,\N,"Action,Drama,Family"
8407396,tt9916852,tvEpisode,Episode #3.20,Episode #3.20,0,2010.0,\N,\N,"Action,Drama,Family"
8407397,tt9916856,short,The Wind,The Wind,0,2015.0,\N,27,Short
8407398,tt9916880,tvEpisode,Horrid Henry Knows It All,Horrid Henry Knows It All,0,2014.0,\N,10,"Adventure,Animation,Comedy"

In [112]:
titles['startYear'].unique()

array([1894., 1892., 1893., 1895., 1896., 1898., 1897., 1900., 1899.,
       1901., 1902., 1903., 1905., 1904., 1912., 1907., 1906., 1908.,
       1910., 1909., 1914., 1911., 1913., 1915., 1919., 1916., 1917.,
       1918., 1936., 1925., 1920., 1922., 1921., 1923., 2019., 1924.,
       1928., 1926., 1927., 1929., 2000., 1993., 1935., 2014., 1930.,
       1942., 1934., 1931., 1932., 1939., 1937., 1933., 1950., 1938.,
       1951., 1945., 1946., 1996., 1940., 1944., 1949., 1947., 1941.,
       1952., 1970., 1957., 1943., 1959., 1948., 2001., 1953., 2008.,
       1954., 1965., 1983., 1980., 1973., 1961., 1995., 1955., 1962.,
       1958., 1956., 1977., 1960., 1964., 1967., 1968., 1963., 1986.,
       1971., 1969., 1972., 1966., 2021., 2002., 1976., 1990., 2020.,
       1979., 1974., 1978., 1981., 1988., 1975., 1989., 1985.,   nan,
       2009., 1987., 2010., 2018., 2007., 1984., 1982., 1992., 1991.,
       1994., 1999., 2005., 2004., 1998., 1997., 2017., 2013., 2016.,
       2006., 2003., 2012., 2015., 2011., 1891., 1888., 1890., 2022.,
       1889., 2023., 2024., 2025., 2027., 2026., 2028., 1878., 1877.,
       1882., 1881., 1887., 1874., 1883., 1885.])

<div class="alert alert-success">
    <b>EXERCISE 08</b>: titles 데이터프레임에는 몇 개의 영화가 기록되어 있나요?
</div>

In [113]:
len(titles)

8407399

<div class="alert alert-success">
    <b>EXERCISE 09</b>: titles에서 가장 빠른 시기에 제작된 영화 두 개를 표시하세요.  힌트: .sort_values()
</div>

In [114]:
titles.sort_values(by='startYear').head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
5329521,tt3155794,short,Passage de Venus,Passage de Venus,0,1874.0,\N,1,"Documentary,Short"
3488807,tt14495706,short,La Rosace Magique,La Rosace Magique,0,1877.0,\N,1,"Animation,Short"

<div class="alert alert-success">
    <b>EXERCISE 10</b>: 제목(title)이 "Hamlet"인 영화는 몇 개가 있나요?
</div>

In [115]:
len(titles[(titles['primaryTitle'] == 'Hamlet') | (titles['originalTitle'] == 'Hamlet')])

136

<div class="alert alert-success">
    <b>EXERCISE 11</b>: 제목(title)이 "Treasure Island"인 영화를 제작년도(year)의 오름차순에 따라 표시하세요
</div>

In [116]:
titles[(titles['primaryTitle'] == 'Treasure Island') | (titles['originalTitle'] == 'Treasure Island')].sort_values(by='startYear')

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
2511,tt0002538,short,Treasure Island,Treasure Island,0,1912.0,\N,\N,"Adventure,Short"
5032142,tt2440348,short,Treasure Island,Treasure Island,0,1913.0,\N,\N,"Short,Thriller"
9589,tt0009721,movie,Treasure Island,Treasure Island,0,1917.0,\N,60,Adventure
11620,tt0011785,movie,Treasure Island,Treasure Island,0,1920.0,\N,76,Adventure
25459,tt0025907,movie,Treasure Island,Treasure Island,0,1934.0,\N,110,"Adventure,Family"
...,...,...,...,...,...,...,...,...,...
6917550,tt6727462,tvEpisode,Treasure Island,Treasure Island,0,2019.0,\N,71,"Drama,Fantasy,Mystery"
3809301,tt15075064,tvEpisode,Treasure Island,Treasure Island,0,2021.0,\N,\N,"Animation,Comedy"
1574276,tt11064450,movie,Treasure Island,Treasure Island,0,NaN,\N,\N,Adventure
4323630,tt1659339,movie,Treasure Island,Treasure Island,0,NaN,\N,\N,Adventure
7838572,tt8709864,tvSeries,Treasure Island,Treasure Island,0,NaN,\N,\N,Reality-TV

<div class="alert alert-success">
    <b>EXERCISE 12</b>: 1950년에서 1959년 사이 몇 개의 영화가 만들어졌나요?(1950 <= 제작년도 <= 1959)
</div>

In [117]:
len(titles[(titles['startYear']<=1959)&(titles['startYear']>=1950)])

118649

# 타이타닉 자료에서 그룹별 연산하기

원격 DB에 접속해서 titanic 데이터베이스 안에 있는 p_info, t_info, survived 테이블을 불러와 합치고 아래의 문제를 풀어보세요.<br>
<id:kict00, pw:kict00, ip:221.155.18.165:3306, db:titanic>

In [118]:
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

In [220]:
engine=create_engine("mysql+pymysql://kict06:kict06@221.155.18.165:3306/titanic")
conn=engine.connect()
passenger=pd.read_sql("passenger",con=conn)
ticket=pd.read_sql("ticket",con=conn)
survived=pd.read_sql("survived",con=conn)
conn.close()
passenger

,PassengerId,Name,Sex,Age,SibSp,Parch
0,193,"Andersen-Jensen, Miss. Carla Christine Nielsine",female,19.0,1,0
1,192,"Carbines, Mr. William",male,19.0,0,0
2,715,"Greenberg, Mr. Samuel",male,52.0,0,0
3,533,"Elias, Mr. Joseph Jr",male,17.0,1,1
4,133,"Robins, Mrs. Alexander A (Grace Charity Laury)",female,47.0,1,0
...,...,...,...,...,...,...
618,580,"Jussila, Mr. Eiriik",male,32.0,0,0
619,503,"O'Sullivan, Miss. Bridget Mary",female,NaN,0,0
620,538,"LeRoy, Miss. Bertha",female,30.0,0,0
621,197,"Mernagh, Mr. Robert",male,NaN,0,0
622,176,"Klasen, Mr. Klas Albin",male,18.0,1,1

In [221]:
ticket

     PassengerId         Ticket  Pclass      Fare    Cabin Embarked
0            486           4133       3   25.4667     None        S
1            119       PC 17558       1  247.5208  B58 B60        C
2            836       PC 17756       1   83.1583      E49        C
3            528       PC 17483       1  221.7792      C95        S
4            396         350052       3    7.7958     None        S
..           ...            ...     ...       ...      ...      ...
440          692         349256       3   13.4167     None        C
441          585           3411       3    8.7125     None        C
442          265         382649       3    7.7500     None        Q
443          328          28551       2   13.0000        D        S
444          136  SC/PARIS 2133       2   15.0458     None        C

[445 rows x 6 columns]

In [222]:
survived

     PassengerId  Survived
0              1         0
1              2         1
2              3         1
3              4         1
4              5         0
..           ...       ...
886          887         0
887          888         1
888          889         0
889          890         1
890          891         0

[891 rows x 2 columns]

In [223]:
titanics=pd.merge(pd.merge(passenger,survived,how='inner',on='PassengerId'),ticket,how='left',on='PassengerId').sort_values(by='PassengerId')
titanics=titanics.set_index('PassengerId')
titanics

,Name,Sex,Age,SibSp,Parch,Survived,Ticket,Pclass,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,"Braund, Mr. Owen Harris",male,22.0,1,0,0,A/5 21171,3.0,7.250,None,S
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,1,NaN,NaN,NaN,NaN,NaN
3,"Heikkinen, Miss. Laina",female,26.0,0,0,1,STON/O2. 3101282,3.0,7.925,None,S
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,1,113803,1.0,53.100,C123,S
5,"Allen, Mr. William Henry",male,35.0,0,0,0,373450,3.0,8.050,None,S
...,...,...,...,...,...,...,...,...,...,...,...
882,"Markun, Mr. Johann",male,33.0,0,0,0,NaN,NaN,NaN,NaN,NaN
884,"Banfield, Mr. Frederick James",male,28.0,0,0,0,NaN,NaN,NaN,NaN,NaN
886,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,0,382652,3.0,29.125,None,Q
887,"Montvila, Rev. Juozas",male,27.0,0,0,0,211536,2.0,13.000,None,S
888,"Graham, Miss. Margaret Edith",female,19.0,0,0,1,112053,1.0,30.000,B42,S

<div class="alert alert-success">
    <b>EXERCISE 13</b>: 데이터의 상위 5개 행을 출력하세요.
</div>

In [124]:
titanics.head(5)

,Name,Sex,Age,SibSp,Parch,Survived,Ticket,Pclass,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,"Braund, Mr. Owen Harris",male,22.0,1,0,0,A/5 21171,3.0,7.250,None,S
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,1,NaN,NaN,NaN,NaN,NaN
3,"Heikkinen, Miss. Laina",female,26.0,0,0,1,STON/O2. 3101282,3.0,7.925,None,S
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,1,113803,1.0,53.100,C123,S
5,"Allen, Mr. William Henry",male,35.0,0,0,0,373450,3.0,8.050,None,S

<div class="alert alert-success">
    <b>EXERCISE 14</b>: 데이터의 정보(info)를 출력하세요.
</div>

In [125]:
titanics.info()

<class 'pandas.core.frame.DataFrame'>
Index: 623 entries, 1 to 888
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      623 non-null    object
 1   Sex       623 non-null    object
 2   Age       501 non-null    float64
 3   SibSp     623 non-null    int64
 4   Parch     623 non-null    int64
 5   Survived  623 non-null    int64
 6   Ticket    317 non-null    object
 7   Pclass    317 non-null    float64
 8   Fare      317 non-null    float64
 9   Cabin     76 non-null     object
 10  Embarked  317 non-null    object
dtypes: float64(3), int64(3), object(5)
memory usage: 58.4+ KB

<div class="alert alert-success">
    <b>EXERCISE 15</b>: 데이터의 기술통계(describe)를 확인하세요.
</div>

In [126]:
titanics.describe()

              Age       SibSp       Parch    Survived      Pclass        Fare
count  501.000000  623.000000  623.000000  623.000000  317.000000  317.000000
mean    29.647206    0.528090    0.385233    0.369181    2.287066   34.090273
std     14.560685    1.088716    0.795429    0.482971    0.828444   53.148991
min      0.420000    0.000000    0.000000    0.000000    1.000000    0.000000
25%     20.000000    0.000000    0.000000    0.000000    2.000000    7.925000
50%     28.000000    0.000000    0.000000    0.000000    3.000000   14.454200
75%     39.000000    1.000000    0.000000    1.000000    3.000000   31.275000
max     71.000000    8.000000    6.000000    1.000000    3.000000  512.329200

<div class="alert alert-success">
    <b>EXERCISE 16</b>: 처음 100명의 데이터를 출력하세요.
</div>

In [127]:
titanics.head(100)

,Name,Sex,Age,SibSp,Parch,Survived,Ticket,Pclass,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,"Braund, Mr. Owen Harris",male,22.0,1,0,0,A/5 21171,3.0,7.2500,None,S
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,1,NaN,NaN,NaN,NaN,NaN
3,"Heikkinen, Miss. Laina",female,26.0,0,0,1,STON/O2. 3101282,3.0,7.9250,None,S
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,1,113803,1.0,53.1000,C123,S
5,"Allen, Mr. William Henry",male,35.0,0,0,0,373450,3.0,8.0500,None,S
...,...,...,...,...,...,...,...,...,...,...,...
131,"Drazenoic, Mr. Jozef",male,33.0,0,0,0,NaN,NaN,NaN,NaN,NaN
132,"Coelho, Mr. Domingos Fernandeo",male,20.0,0,0,0,NaN,NaN,NaN,NaN,NaN
133,"Robins, Mrs. Alexander A (Grace Charity Laury)",female,47.0,1,0,0,A/5. 3337,3.0,14.5000,None,S
134,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,1,NaN,NaN,NaN,NaN,NaN
136,"Richard, Mr. Emile",male,23.0,0,0,0,SC/PARIS 2133,2.0,15.0458,None,C

<div class="alert alert-success">
    <b>EXERCISE 17</b>: 인덱스가 10~20인 데이터를 출력하세요.
</div>

In [128]:
titanics.loc[10:21]

,Name,Sex,Age,SibSp,Parch,Survived,Ticket,Pclass,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
11,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,1,PP 9549,3.0,16.7000,G6,S
12,"Bonnell, Miss. Elizabeth",female,58.0,0,0,1,113783,1.0,26.5500,C103,S
13,"Saundercock, Mr. William Henry",male,20.0,0,0,0,NaN,NaN,NaN,NaN,NaN
15,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,0,350406,3.0,7.8542,None,S
17,"Rice, Master. Eugene",male,2.0,4,1,0,382652,3.0,29.1250,None,Q
18,"Williams, Mr. Charles Eugene",male,NaN,0,0,1,NaN,NaN,NaN,NaN,NaN
19,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,0,345763,3.0,18.0000,None,S
20,"Masselmani, Mrs. Fatima",female,NaN,0,0,1,2649,3.0,7.2250,None,C

<div class="alert alert-success">
    <b>EXERCISE</b>: 컬럼 이름을 모두 출력하세요.
</div>

In [129]:
titanics.columns

Index(['Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Survived', 'Ticket', 'Pclass',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

<div class="alert alert-success">
    <b>EXERCISE 18</b>: 데이터의 shape를 확인하세요.
</div>

In [130]:
titanics.shape

(623, 11)

<div class="alert alert-success">
    <b>EXERCISE 19</b>: 'Age' 컬럼의 평균을 구하세요.
</div>

In [131]:
titanics['Age'].mean()

np.float64(29.647205588822356)

<div class="alert alert-success">
    <b>EXERCISE 20</b>: 'Survived' 컬럼의 고유값을 확인하세요.
</div>

In [132]:
titanics['Survived'].unique()

array([0, 1])

<div class="alert alert-success">
    <b>EXERCISE 21</b>: 나이가 30 이상인 승객만 출력하세요.
</div>

In [133]:
titanics[titanics['Age']>=30]

,Name,Sex,Age,SibSp,Parch,Survived,Ticket,Pclass,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,1,NaN,NaN,NaN,NaN,NaN
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,1,113803,1.0,53.1000,C123,S
5,"Allen, Mr. William Henry",male,35.0,0,0,0,373450,3.0,8.0500,None,S
7,"McCarthy, Mr. Timothy J",male,54.0,0,0,0,NaN,NaN,NaN,NaN,NaN
12,"Bonnell, Miss. Elizabeth",female,58.0,0,0,1,113783,1.0,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...
868,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,0,PC 17590,1.0,50.4958,A24,S
872,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,1,NaN,NaN,NaN,NaN,NaN
874,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,0,345765,3.0,9.0000,None,S
882,"Markun, Mr. Johann",male,33.0,0,0,0,NaN,NaN,NaN,NaN,NaN
886,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,0,382652,3.0,29.1250,None,Q

<div class="alert alert-success">
    <b>EXERCISE 22</b>: 성별이 'female'이고 생존한 승객만 출력하세요.
</div>

In [134]:
titanics[(titanics['Sex']=='female')&(titanics['Survived']==1)]

,Name,Sex,Age,SibSp,Parch,Survived,Ticket,Pclass,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,1,NaN,NaN,NaN,NaN,NaN
3,"Heikkinen, Miss. Laina",female,26.0,0,0,1,STON/O2. 3101282,3.0,7.9250,None,S
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,1,113803,1.0,53.1000,C123,S
9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,1,347742,3.0,11.1333,None,S
11,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,1,PP 9549,3.0,16.7000,G6,S
...,...,...,...,...,...,...,...,...,...,...,...
863,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,1,17466,1.0,25.9292,D17,S
866,"Bystrom, Mrs. (Karolina)",female,42.0,0,0,1,236852,2.0,13.0000,None,S
872,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,1,NaN,NaN,NaN,NaN,NaN
876,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,1,2667,3.0,7.2250,None,C
888,"Graham, Miss. Margaret Edith",female,19.0,0,0,1,112053,1.0,30.0000,B42,S

<div class="alert alert-success">
    <b>EXERCISE 23</b>: 나이가 10살 이하이고 요금이 20 이상인 승객을 출력하세요.
</div>

In [135]:
titanics[(titanics['Age']<=10)&(titanics['Fare']>=20)]

,Name,Sex,Age,SibSp,Parch,Survived,Ticket,Pclass,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
17,"Rice, Master. Eugene",male,2.00,4,1,0,382652,3.0,29.1250,None,Q
79,"Caldwell, Master. Alden Gates",male,0.83,0,2,1,248738,2.0,29.0000,None,S
166,"Goldsmith, Master. Frank John William ""Frankie""",male,9.00,0,2,1,363291,3.0,20.5250,None,S
184,"Becker, Master. Richard F",male,1.00,2,1,1,230136,2.0,39.0000,F4,S
185,"Kink-Heilmann, Miss. Luise Gretchen",female,4.00,0,2,1,315153,3.0,22.0250,None,S
194,"Navratil, Master. Michel M",male,3.00,1,1,1,230080,2.0,26.0000,F2,S
234,"Asplund, Miss. Lillian Gertrud",female,5.00,4,2,1,347077,3.0,31.3875,None,S
279,"Rice, Master. Eric",male,7.00,4,1,0,382652,3.0,29.1250,None,Q
375,"Palsson, Miss. Stina Viola",female,3.00,3,1,0,349909,3.0,21.0750,None,S
619,"Becker, Miss. Marion Louise",female,4.00,2,1,1,230136,2.0,39.0000,F4,S
721,"Harper, Miss. Annie Jessie ""Nina""",female,6.00,0,1,1,248727,2.0,33.0000,None,S
751,"Wells, Miss. Joan",female,4.00,1,1,1,29103,2.0,23.0000,None,S
789,"Dean, Master. Bertram Vere",male,1.00,1,2,1,C.A. 2315,3.0,20.5750,None,S
820,"Skoog, Master. Karl Thorsten",male,10.00,3,2,0,347088,3.0,27.9000,None,S
851,"Andersson, Master. Sigvard Harald Elias",male,4.00,4,2,0,347082,3.0,31.2750,None,S

<div class="alert alert-success">
    <b>EXERCISE 24</b>: 나이가 결측치인 데이터를 출력하세요.
</div>

In [136]:
titanics[titanics['Age'].isna()]

,Name,Sex,Age,SibSp,Parch,Survived,Ticket,Pclass,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
6,"Moran, Mr. James",male,NaN,0,0,0,NaN,NaN,NaN,NaN,NaN
18,"Williams, Mr. Charles Eugene",male,NaN,0,0,1,NaN,NaN,NaN,NaN,NaN
20,"Masselmani, Mrs. Fatima",female,NaN,0,0,1,2649,3.0,7.2250,None,C
29,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,1,330959,3.0,7.8792,None,Q
30,"Todoroff, Mr. Lalio",male,NaN,0,0,0,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
840,"Marechal, Mr. Pierre",male,NaN,0,0,1,11774,1.0,29.7000,C47,C
850,"Goldenberg, Mrs. Samuel L (Edwiga Grabowska)",female,NaN,1,0,1,17453,1.0,89.1042,C92,C
860,"Razi, Mr. Raihed",male,NaN,0,0,0,2629,3.0,7.2292,None,C
864,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,0,NaN,NaN,NaN,NaN,NaN
869,"van Melkebeke, Mr. Philemon",male,NaN,0,0,0,NaN,NaN,NaN,NaN,NaN

<div class="alert alert-success">
    <b>EXERCISE 25</b>: 나이를 기준으로 오름차순 정렬하세요.
</div>

In [137]:
titanics.sort_values(by='Age')

,Name,Sex,Age,SibSp,Parch,Survived,Ticket,Pclass,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
804,"Thomas, Master. Assad Alexander",male,0.42,0,1,1,NaN,NaN,NaN,NaN,NaN
756,"Hamalainen, Master. Viljo",male,0.67,1,1,1,NaN,NaN,NaN,NaN,NaN
470,"Baclini, Miss. Helene Barbara",female,0.75,2,1,1,2666,3.0,19.2583,None,C
645,"Baclini, Miss. Eugenie",female,0.75,2,1,1,NaN,NaN,NaN,NaN,NaN
832,"Richards, Master. George Sibley",male,0.83,1,1,1,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
840,"Marechal, Mr. Pierre",male,NaN,0,0,1,11774,1.0,29.7000,C47,C
850,"Goldenberg, Mrs. Samuel L (Edwiga Grabowska)",female,NaN,1,0,1,17453,1.0,89.1042,C92,C
860,"Razi, Mr. Raihed",male,NaN,0,0,0,2629,3.0,7.2292,None,C
864,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,0,NaN,NaN,NaN,NaN,NaN
869,"van Melkebeke, Mr. Philemon",male,NaN,0,0,0,NaN,NaN,NaN,NaN,NaN

<div class="alert alert-success">
    <b>EXERCISE 26</b>: 요금을 기준으로 내림차순 정렬하고 상위 5명만 출력하세요.
</div>

In [138]:
titanics.sort_values(by='Fare',ascending=False).head(5)

,Name,Sex,Age,SibSp,Parch,Survived,Ticket,Pclass,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
680,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,1,PC 17755,1.0,512.3292,B51 B53 B55,C
28,"Fortune, Mr. Charles Alexander",male,19.0,3,2,0,19950,1.0,263.0000,C23 C25 C27,S
312,"Ryerson, Miss. Emily Borie",female,18.0,2,2,1,PC 17608,1.0,262.3750,B57 B59 B63 B66,C
119,"Baxter, Mr. Quigg Edmond",male,24.0,0,1,0,PC 17558,1.0,247.5208,B58 B60,C
381,"Bidois, Miss. Rosalie",female,42.0,0,0,1,PC 17757,1.0,227.5250,None,C

<div class="alert alert-success">
    <b>EXERCISE 27</b>: 성별로 그룹화하여 생존률 평균을 구하세요.
</div>

In [139]:
titanics[['Sex','Survived']].groupby(['Sex']).agg(['mean'])

        Survived
            mean
Sex
female  0.748858
male    0.163366

<div class="alert alert-success">
    <b>EXERCISE 28</b>: Pclass별 평균 나이를 구하세요.
</div>

In [140]:
titanics[['Pclass','Age']].groupby(['Pclass']).agg(['mean'])

              Age
             mean
Pclass
1.0     36.779412
2.0     29.556324
3.0     23.914583

<div class="alert alert-success">
    <b>EXERCISE 29</b>: 'Age'에 10을 더한 값을 새로운 컬럼 'Age_plus_10'으로 추가하세요.
</div>

In [141]:
Age_plus_10=titanics['Age']+10
Age_plus_10

PassengerId
1      32.0
2      48.0
3      36.0
4      45.0
5      45.0
       ...
882    43.0
884    38.0
886    49.0
887    37.0
888    29.0
Name: Age, Length: 623, dtype: float64

<div class="alert alert-success">
    <b>EXERCISE 30</b>: 'Age'가 18 이상이면 '성인', 아니면 '미성년'으로 분류하는 컬럼을 추가하세요.
</div>

In [224]:
titanics2=titanics.copy()

In [225]:
titanics['Age_cate']=pd.cut(titanics['Age'],bins=[0,18,titanics['Age'].max()],labels=['미성년','성인'])
titanics

,Name,Sex,Age,SibSp,Parch,Survived,Ticket,Pclass,Fare,Cabin,Embarked,Age_cate
PassengerId,,,,,,,,,,,,
1,"Braund, Mr. Owen Harris",male,22.0,1,0,0,A/5 21171,3.0,7.250,None,S,성인
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,1,NaN,NaN,NaN,NaN,NaN,성인
3,"Heikkinen, Miss. Laina",female,26.0,0,0,1,STON/O2. 3101282,3.0,7.925,None,S,성인
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,1,113803,1.0,53.100,C123,S,성인
5,"Allen, Mr. William Henry",male,35.0,0,0,0,373450,3.0,8.050,None,S,성인
...,...,...,...,...,...,...,...,...,...,...,...,...
882,"Markun, Mr. Johann",male,33.0,0,0,0,NaN,NaN,NaN,NaN,NaN,성인
884,"Banfield, Mr. Frederick James",male,28.0,0,0,0,NaN,NaN,NaN,NaN,NaN,성인
886,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,0,382652,3.0,29.125,None,Q,성인
887,"Montvila, Rev. Juozas",male,27.0,0,0,0,211536,2.0,13.000,None,S,성인
888,"Graham, Miss. Margaret Edith",female,19.0,0,0,1,112053,1.0,30.000,B42,S,성인

<div class="alert alert-success">
    <b>EXERCISE 31</b>: 'Age'의 결측치를 평균으로 채우세요.
</div>

In [226]:
titanics['Age'].unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  ,  4.  ,
       58.  , 20.  , 14.  , 31.  , 34.  , 28.  , 19.  , 40.  , 66.  ,
       42.  , 21.  , 18.  ,  3.  , 49.  ,  5.  , 11.  , 45.  , 17.  ,
       32.  , 16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 29.  ,
       46.  , 71.  , 37.  , 14.5 , 70.5 , 32.5 , 47.  , 51.  , 55.5 ,
       44.  ,  9.  , 61.  ,  1.  , 56.  , 50.  , 36.  , 45.5 , 20.5 ,
       62.  , 41.  , 52.  , 63.  ,  7.  , 65.  , 43.  , 60.  , 39.  ,
       64.  , 13.  , 48.  ,  0.75, 40.5 ,  8.  , 53.  , 57.  , 70.  ,
       24.5 , 15.  ,  6.  , 28.5 ,  0.67,  0.42, 10.  , 34.5 ])

In [227]:
titanics['Age']=titanics['Age'].fillna(titanics['Age'].mean())
titanics['Age'].unique()

array([22.        , 38.        , 26.        , 35.        , 29.64720559,
       54.        ,  2.        , 27.        ,  4.        , 58.        ,
       20.        , 14.        , 31.        , 34.        , 28.        ,
       19.        , 40.        , 66.        , 42.        , 21.        ,
       18.        ,  3.        , 49.        ,  5.        , 11.        ,
       45.        , 17.        , 32.        , 16.        , 25.        ,
        0.83      , 30.        , 33.        , 23.        , 24.        ,
       29.        , 46.        , 71.        , 37.        , 14.5       ,
       70.5       , 32.5       , 47.        , 51.        , 55.5       ,
       44.        ,  9.        , 61.        ,  1.        , 56.        ,
       50.        , 36.        , 45.5       , 20.5       , 62.        ,
       41.        , 52.        , 63.        ,  7.        , 65.        ,
       43.        , 60.        , 39.        , 64.        , 13.        ,
       48.        ,  0.75      , 40.5       ,  8.        , 53.        ,
       57.        , 70.        , 24.5       , 15.        ,  6.        ,
       28.5       ,  0.67      ,  0.42      , 10.        , 34.5       ])

<div class="alert alert-success">
    <b>EXERCISE 32</b>: 'Cabin' 컬럼의 결측치를 'Unknown'으로 채우세요.
</div>

In [228]:
titanics['Cabin'].isna()

PassengerId
1       True
2       True
3       True
4      False
5       True
       ...
882     True
884     True
886     True
887     True
888    False
Name: Cabin, Length: 623, dtype: bool

In [229]:
titanics['Cabin']=titanics['Cabin'].fillna('Unknown')
titanics['Cabin'].unique()

array(['Unknown', 'C123', 'G6', 'C103', 'D56', 'A6', 'C23 C25 C27', 'B78',
       'D33', 'C83', 'A5', 'B58 B60', 'E101', 'D47', 'C2', 'B19', 'C49',
       'F4', 'A32', 'F2', 'B4', 'B80', 'D36', 'C93', 'D35', 'B77', 'E67',
       'B94', 'C125', 'C118', 'A19', 'C65', 'B57 B59 B63 B66', 'C7',
       'E40', 'E33', 'D37', 'B35', 'E50', 'C82', 'C52', 'E38', 'E63', 'D',
       'C22 C26', 'C95', 'B39', 'C70', 'C101', 'E68', 'D20', 'A20', 'D48',
       'B71', 'B51 B53 B55', 'B5', 'F G63', 'E24', 'C90', 'C126', 'F G73',
       'E8', 'B22', 'B96 B98', 'E121', 'C47', 'C92', 'E17', 'D17', 'A24',
       'B42'], dtype=object)

<div class="alert alert-success">
    <b>EXERCISE 33</b>: 중복된 'Ticket' 값을 제거하고 몇 개가 남는지 출력하세요.
</div>

In [230]:
len(titanics.drop_duplicates(subset='Ticket'))

285

<div class="alert alert-success">
    <b>EXERCISE 34</b>: 'Embarked' 컬럼의 고유값과 각각의 개수를 출력하세요.
</div>

In [231]:
titanics['Embarked'].unique()

array(['S', nan, 'Q', 'C'], dtype=object)

In [232]:
titanics['Embarked'].value_counts()

Embarked
S    227
C     68
Q     22
Name: count, dtype: int64

<div class="alert alert-success">
    <b>EXERCISE 35</b>: 인덱스를 'PassengerId'로 설정하세요.
</div>

In [236]:
titanics=titanics.set_index("PassengerId")
titanics

,Name,Sex,Age,SibSp,Parch,Survived,Ticket,Pclass,Fare,Cabin,Embarked,Age_cate
PassengerId,,,,,,,,,,,,
1,"Braund, Mr. Owen Harris",male,22.0,1,0,0,A/5 21171,3.0,7.250,Unknown,S,성인
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,1,NaN,NaN,NaN,Unknown,NaN,성인
3,"Heikkinen, Miss. Laina",female,26.0,0,0,1,STON/O2. 3101282,3.0,7.925,Unknown,S,성인
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,1,113803,1.0,53.100,C123,S,성인
5,"Allen, Mr. William Henry",male,35.0,0,0,0,373450,3.0,8.050,Unknown,S,성인
...,...,...,...,...,...,...,...,...,...,...,...,...
882,"Markun, Mr. Johann",male,33.0,0,0,0,NaN,NaN,NaN,Unknown,NaN,성인
884,"Banfield, Mr. Frederick James",male,28.0,0,0,0,NaN,NaN,NaN,Unknown,NaN,성인
886,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,0,382652,3.0,29.125,Unknown,Q,성인
887,"Montvila, Rev. Juozas",male,27.0,0,0,0,211536,2.0,13.000,Unknown,S,성인
888,"Graham, Miss. Margaret Edith",female,19.0,0,0,1,112053,1.0,30.000,B42,S,성인

<div class="alert alert-success">
    <b>EXERCISE 36</b>: 인덱스를 초기화하세요.
</div>

In [237]:
titanics.reset_index(inplace=True)
titanics

,PassengerId,Name,Sex,Age,SibSp,Parch,Survived,Ticket,Pclass,Fare,Cabin,Embarked,Age_cate
0,1,"Braund, Mr. Owen Harris",male,22.0,1,0,0,A/5 21171,3.0,7.250,Unknown,S,성인
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,1,NaN,NaN,NaN,Unknown,NaN,성인
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,1,STON/O2. 3101282,3.0,7.925,Unknown,S,성인
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,1,113803,1.0,53.100,C123,S,성인
4,5,"Allen, Mr. William Henry",male,35.0,0,0,0,373450,3.0,8.050,Unknown,S,성인
...,...,...,...,...,...,...,...,...,...,...,...,...,...
618,882,"Markun, Mr. Johann",male,33.0,0,0,0,NaN,NaN,NaN,Unknown,NaN,성인
619,884,"Banfield, Mr. Frederick James",male,28.0,0,0,0,NaN,NaN,NaN,Unknown,NaN,성인
620,886,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,0,382652,3.0,29.125,Unknown,Q,성인
621,887,"Montvila, Rev. Juozas",male,27.0,0,0,0,211536,2.0,13.000,Unknown,S,성인
622,888,"Graham, Miss. Margaret Edith",female,19.0,0,0,1,112053,1.0,30.000,B42,S,성인

In [238]:
titanics2=titanics.copy()

<div class="alert alert-success">
    <b>EXERCISE 37</b>: 성별과 Pclass의 생존률을 피벗 테이블로 만드세요.
</div>

In [239]:
titanics.pivot_table(values='Survived',index='Sex',columns='Pclass')

Pclass       1.0       2.0       3.0
Sex
female  0.944444  0.920000  0.530612
male    0.400000  0.142857  0.110169

<div class="alert alert-success">
    <b>EXERCISE 38</b>: groupby()를 사용하여 각 성별(sex)의 평균 나이(age)를 구하세요.
</div>

In [241]:
titanics[['Sex','Age']].groupby('Sex').mean()

              Age
Sex
female  28.231961
male    30.414380

<div class="alert alert-success">
    <b>EXERCISE 39</b>: 전체 승객(passenger)의 평균 생존율을 구하세요.
</div>

In [242]:
titanics['Survived'].mean()

np.float64(0.36918138041733545)

<div class="alert alert-success">
    <b>EXERCISE 40</b>: 25세 이하 승객의 생존율을 구하세요. (힌트: 불리언 인덱싱)
</div>

In [245]:
titanics[titanics['Age']<25]['Survived'].mean()

np.float64(0.41919191919191917)

<div class="alert alert-success">
    <b>EXERCISE 41</b>: 남성의 생존율을 구하세요. 여성의 생존율을 구하세요. (힌트: 불리언 인덱싱)
</div>

In [246]:
titanics[titanics['Sex']=='male']['Survived'].mean()

np.float64(0.16336633663366337)

In [247]:
titanics[titanics['Sex']=='female']['Survived'].mean()

np.float64(0.7488584474885844)

<div class="alert alert-success">
    <b>EXERCISE 42</b>: 생존율을 구하는 함수가 작성되어 있습니다. 성별 생존율을 groupby를 활용해 구하기 위해 ?부분을 알맞게 채워주세요.
</div>

In [251]:
def survival_ratio(survived):
    return survived.sum() / len(survived)

In [256]:
titanics[['Sex','Survived']].groupby('Sex').agg(survival_ratio)

        Survived
Sex
female  0.748858
male    0.163366